{"docstore/data":{"d125752a-d69a-434e-bd6e-4bc157f25f56":{"indexId":"d125752a-d69a-434e-bd6e-4bc157f25f56","nodesDict":{"b85fe36a-d04b-4826-a91a-cd4634c6df9e":{"id_":"b85fe36a-d04b-4826-a91a-cd4634c6df9e","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/creative.pdf","metadata":{},"hash":"TEeh25sR8bXWD5Ubq5BVZBknks/PWCBNDbHOvzSevgw="},"NEXT":{"nodeId":"7c02ecd8-bf78-4232-82a1-a268259ac4db","metadata":{},"hash":"xKN2aRlH0g4RWhd/dUxESENZ598hV2P7e8Mzfwkr6vM="}},"hash":"cwU/RqbH7UudjyVOV46FsJOgkiLo2js0WxwqBK4IuHI=","text":"FinVent - Our Story\nWelcome to FinVent! At FinVent, our mission is to bring clarity and transparency to managing your finances for\nsignificant life events. Founded with the vision of simplifying financial planning for weddings,\ngraduations, corporate events, and other special occasions, we partner with Capital One to\noffer tools that help you track and manage your event expenses effectively. Our goal is to\nensure you have confidence in every financial decision, so you can focus on enjoying your\nmilestone moments without financial stress. Whether you're planning a wedding, celebrating a graduation, or organizing a corporate\nevent, FinVent is here to make the financial side of things easy and straightforward. We\nprovide you with the tools and insights you need to manage your budget, track expenses,\nand make informed decisions, so you can focus on what truly matters. FAQs\n1. When will I see my payment reflected in my account? Payments are processed instantly. Once you complete a transaction, you will see the\npayment reflected in your account immediately. 2. How can I track my expenses for an event? You can track your expenses using our intuitive dashboard, which allows you to categorize\nand monitor your spending in real-time. Simply input your expenses and review your to help\nyou stay on top of your financial goals. 3. What types of events can I use FinVent for? FinVent is designed for a wide range of events, including weddings, graduations, corporate\nevents, and any other special occasions where managing finances is essential. 4. How do I get started with FinVent? Getting started is easy! Sign up for a FinVent account, link your Capital One account, and\nbegin inputting your event details. Our platform will guide you through setting up your\ntracking expenses for your important events. 5. Is my financial data secure with FinVent? Absolutely. We prioritize the security of your financial data\n6. Can I access FinVent from my mobile device? Yes, FinVent is accessible from any device with an internet connection through the website\nbut not an app\n\n7. What if I need help using FinVent? We offer a variety of resources to assist you, including tutorials, a help center, and customer\nsupport. Visit our website’s help section or contact our support team for personalized\nassistance. 8.","textTemplate":"","metadataSeparator":"\n","type":"TEXT"},"7c02ecd8-bf78-4232-82a1-a268259ac4db":{"id_":"7c02ecd8-bf78-4232-82a1-a268259ac4db","metadata":{},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/creative.pdf","metadata":{},"hash":"TEeh25sR8bXWD5Ubq5BVZBknks/PWCBNDbHOvzSevgw="},"PREVIOUS":{"nodeId":"b85fe36a-d04b-4826-a91a-cd4634c6df9e","metadata":{},"hash":"cwU/RqbH7UudjyVOV46FsJOgkiLo2js0WxwqBK4IuHI="}},"hash":"xKN2aRlH0g4RWhd/dUxESENZ598hV2P7e8Mzfwkr6vM=","text":"Visit our website’s help section or contact our support team for personalized\nassistance. 8. How does FinVent collaborate with Capital One? Our collaboration with Capital One is for the HACKMTY2024","textTemplate":"","metadataSeparator":"\n","type":"TEXT"}},"type":"simple_dict"}}}